## 🏗️ Terraform Plan Results

**Environment:** `dev` (from branch: `create-s3-bucket`)
**Var File:** `environments/dev.tfvars`

### 📊 Plan Summary
- **Add:** 1 resources
- **Change:** 0 resources  
- **Destroy:** 0 resources

### 🔍 Validation Results

#### Terraform Format and Style 🖌️
`failure`

#### Terraform Initialization ⚙️
`success`

#### Terraform Validation 🤖
`success`

#### Terraform Plan 📖
`successskipped`

<details><summary>Show Plan Details</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_eip.nat[0] has been changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0759247c73135c8f0"
        id                   = "eipalloc-0a0821f06e297623e"
      + network_interface    = "eni-0c4960c59ef8b8468"
      + private_dns          = "ip-10-0-0-163.ec2.internal"
      + private_ip           = "10.0.0.163"
        tags                 = {
            "Environment" = "dev"
            "Name"        = "wildfire-assessment-eip-1"
        }
        # (9 unchanged attributes hidden)
    }
  # aws_eip.nat[1] has been changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0ad2d08d4e5b2ac0f"
        id                   = "eipalloc-084f64295cd05b233"
      + network_interface    = "eni-0834312c23bbf0c62"
      + private_dns          = "ip-10-0-1-35.ec2.internal"
      + private_ip           = "10.0.1.35"
        tags                 = {
            "Environment" = "dev"
            "Name"        = "wildfire-assessment-eip-2"
        }
        # (9 unchanged attributes hidden)
    }
  # aws_nat_gateway.main[0] has been changed
  ~ resource "aws_nat_gateway" "main" {
        id                                 = "nat-016a001aa78dc8ff7"
      + secondary_allocation_ids           = []
        tags                               = {
            "Environment" = "dev"
            "Name"        = "wildfire-assessment-nat-1"
        }
        # (10 unchanged attributes hidden)
    }
  # aws_nat_gateway.main[1] has been changed
  ~ resource "aws_nat_gateway" "main" {
        id                                 = "nat-023dba5c9f70c5cac"
      + secondary_allocation_ids           = []
        tags                               = {
            "Environment" = "dev"
            "Name"        = "wildfire-assessment-nat-2"
        }
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.wildfire_assessment will be created
  + resource "aws_s3_bucket" "wildfire_assessment" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "wildfire-assessment-{var.environment}"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "{var.environment}"
          + "Name"        = "wildfire-assessment-{var.environment}"
        }
      + tags_all                    = {
          + "Environment" = "{var.environment}"
          + "Name"        = "wildfire-assessment-{var.environment}"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
 
```

</details>

### 🎯 Next Steps
✅ Plan looks good! You can proceed with merging this PR.

---
*Pusher: @wfsan, Action: `pull_request`*